In [76]:
import pandas as pd

In [77]:
df=pd.read_csv('c:/Users/Admin/Downloads/insurance.csv')
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [78]:
df.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [79]:
df.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

In [80]:
df.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

In [81]:
df.shape

(1338, 7)

In [82]:
a=pd.get_dummies(df['sex'],drop_first=True)
a.head()

   male
0     0
1     1
2     1
3     1
4     1

In [83]:
b=pd.get_dummies(df['smoker'],drop_first=True)
b.head()

   yes
0    1
1    0
2    0
3    0
4    0

In [84]:
df=df.drop(['sex','smoker','region'],axis=1)
df.head()

   age     bmi  children      charges
0   19  27.900         0  16884.92400
1   18  33.770         1   1725.55230
2   28  33.000         3   4449.46200
3   33  22.705         0  21984.47061
4   32  28.880         0   3866.85520

In [85]:
df=pd.concat([df,a,b],axis=1)
df.head()

   age     bmi  children      charges  male  yes
0   19  27.900         0  16884.92400     0    1
1   18  33.770         1   1725.55230     1    0
2   28  33.000         3   4449.46200     1    0
3   33  22.705         0  21984.47061     1    0
4   32  28.880         0   3866.85520     1    0

In [86]:
x=df.drop(['charges'],axis=1)
y=df['charges']

In [87]:
x.head()

   age     bmi  children  male  yes
0   19  27.900         0     0    1
1   18  33.770         1     1    0
2   28  33.000         3     1    0
3   33  22.705         0     1    0
4   32  28.880         0     1    0

In [88]:
y.head()

0    16884.92400
1     1725.55230
2     4449.46200
3    21984.47061
4     3866.85520
Name: charges, dtype: float64

In [89]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.2, random_state=42)

In [90]:
x_train.head()

      age    bmi  children  male  yes
560    46  19.95         2     0    0
1285   47  24.32         0     0    0
1142   52  24.86         0     0    0
969    39  34.32         5     0    0
486    54  21.47         3     0    0

In [91]:
y_train.head()

560      9193.83850
1285     8534.67180
1142    27117.99378
969      8596.82780
486     12475.35130
Name: charges, dtype: float64

In [92]:
x_test.head()

      age     bmi  children  male  yes
764    45  25.175         2     0    0
887    36  30.020         0     0    0
890    64  26.885         0     0    1
1293   46  25.745         3     1    0
259    19  31.920         0     1    1

In [93]:
y_test.head()

764      9095.06825
887      5272.17580
890     29330.98315
1293     9301.89355
259     33750.29180
Name: charges, dtype: float64

In [94]:
from sklearn.preprocessing import StandardScaler

In [95]:
sc=StandardScaler()

In [96]:
x_train=sc.fit_transform(x_train)
x_test=sc.transform(x_test)

In [107]:
from sklearn.linear_model import LinearRegression
import numpy as np

In [108]:
reg=LinearRegression()

In [109]:
reg.fit(x_train,y_train)

LinearRegression()

In [110]:
reg.coef_

array([ 3.61628729e+03,  1.97848617e+03,  5.19291478e+02, -3.97472024e+00,
        9.55960269e+03])

In [111]:
reg.intercept_

13346.089736364485

In [112]:
reg.score(x_train,y_train)

0.7410888590280913

In [115]:
ypred=reg.predict(x_test)
ypred

array([ 8554.81711589,  6973.58746745, 36798.60416104,  9417.88282303,
       26871.68031081, 11097.38383938,   145.27608963, 16746.1683771 ,
         747.53414191, 11153.67590722, 28518.15016561,  9292.18345421,
        5460.51975119, 38510.48013003, 40359.30938604, 37223.40538064,
       15316.56711945, 36047.50032223,  9326.29049907, 31400.1559532 ,
        4269.64414373, 10464.66374097,  2719.9260555 ,  6579.53742551,
       11232.00255515, 12472.06793446, 14807.11281089,  6066.19283362,
        9535.69029723,  2377.6983797 ,  9475.05690885, 12963.23366722,
        4706.09057393,  3414.674504  ,  4815.64981654, 12484.17176954,
        2359.13614479,  9161.02061228, 33238.67621442, 32743.41702445,
        4274.58967205,  4229.5442107 , 14435.36485176, 11384.66898976,
        8925.70468583, 12480.09178788,  5154.45787816,  3554.10047649,
       35649.60942684,  9276.25523701, 15971.35991397,  2552.75200479,
       12162.99980138,  1062.65132285, 13551.43771934, 12103.65505529,
        3929.66908369, 32047.27892811, 13637.90785926, 12401.6930749 ,
       14497.45910305, 10576.37158212, 16665.52678986,  7721.37886148,
       11366.73201797,  4006.31579694, 27057.57750321, 11174.83104806,
        2114.94429381,  6471.68791551, 10209.58863431, 11145.56236211,
       11142.55094459,  9351.22917834, 12082.81125665,  6940.8341161 ,
        6773.90177233, 10683.64525886,  6747.59450058,  9154.026641  ,
        3936.66821244, 36214.28308055,  6727.76310638, 30318.20099861,
       34836.98401781, 34809.70245765,  7212.66214292, 12752.30079216,
        9845.38885092, 14772.74184841, 17156.7224695 , 35522.86112582,
       32606.76076254,  5756.90763406, 32152.35357006,  9819.512411  ,
       29661.50604547,  3836.53394134, 28282.08948639,  5424.04518496,
        5329.46149993,  2236.57757356, 11604.92366908, 15380.18197847,
       11307.60892238,  4462.2723887 , 10096.1436924 , 32002.6057091 ,
        -462.01718266, 33086.32828478,  3604.26654205, 10229.77879529,
       13834.25116273, 31162.92096386, 10991.66387786,  4255.83658348,
       12668.55551697, 32194.07111422,  8340.6414313 ,  3179.75445397,
        7944.63722212, 10474.57943807, 14679.37989808,  5793.6038508 ,
        3749.02518416, 10109.14302101, 11041.06297998, 10672.55525164,
       14582.79719996,  7518.11264541,  5588.30008858,  9398.72411654,
        9483.82308524, 11994.27261733,  8655.33752191, 15624.41351783,
        7905.79140047, 32155.40209722, 35608.91675629, 31133.48521476,
        5946.76990251, 12105.36493684,  6163.6270294 , 14399.33874401,
        2736.03365609, 33368.24623463,  6208.81419105,  5386.91182361,
       14196.13600681,  7293.03723381, 38519.75566503,  3009.37728211,
        5980.5670286 , 31200.91355909, 11368.82072275,  7976.16626004,
       14333.97374161, 10015.70369922, 27269.39698029, 32977.42410324,
       14074.81149052,  1630.46376886, 13570.37735406,  1819.02950988,
        5783.29227727, 11707.69827069, 40083.81014766, 36399.32719546,
       33538.96469556,  4237.53826618,  7886.64616954,  8984.33189836,
       11875.22850945,  4769.57089541,  2418.22413603, 32364.62251199,
       25489.48888369, 17589.56717446, 26439.80058571, 10131.7064427 ,
       36821.57635284,  -780.27258246,  6797.9234782 ,  8092.02730321,
        3989.77721558,  4977.80885262,  5468.9446385 ,  4671.29594238,
       15239.86324012, 11072.05386772,  7224.43973683,  2066.30499237,
        1134.29276297, 32245.61350846, 16534.99895257, 12165.95863685,
        1225.95987965, 12081.94944404,  1132.83447879,  9124.85480951,
        1851.41177422, 33861.40324427, 10928.70665865,  2547.61735158,
       25900.0852432 , 26587.76850535,  9382.20516711,  1793.74237878,
       13368.37771854,  1553.2243181 , 10826.08981163, 10820.98768404,
       16310.76587058, 27079.35017098,  7194.37614586,  4746.62865049,
        6056.45136244, 13450.63849673, 11345.08357281,  8516.1383574 ,
        4984.49406043, 12133.7557559 , 13912.04624137, 35906.90003962,
        4051.21525048, 29106.69292807,  -481.95058879,  2782.15742307,
       11252.1998789 , 15774.76042909,  5346.65514236,  6909.04574459,
        4253.38194916, 31691.89732972,  7259.46175823, 12544.58608615,
        5529.49607139,  9844.38618798, 36414.38528198,  4594.92088295,
        9316.01345646, 31469.44877307,  5608.26602033,  4797.39892382,
        1008.56344727,  4737.21857795,  4946.16017613,  6849.36386051,
       18702.5986979 , -1511.80693939,  2722.91999531, 11005.05177119,
        3534.8443421 ,  9820.54960484,  3621.86753116,  5296.93237781,
       12768.4532386 ,  6097.94352203,  7849.39316961,  7125.58436652,
        8848.00703509, 10475.43724853, 28020.96417654, 39220.99588896,
       11695.63412399,  7253.59867464, 40950.53990359, 12625.96641871])

In [117]:
y_test

764      9095.06825
887      5272.17580
890     29330.98315
1293     9301.89355
259     33750.29180
           ...
109     47055.53210
575     12222.89830
535      6067.12675
543     63770.42801
846      9872.70100
Name: charges, Length: 268, dtype: float64

In [119]:
pd.DataFrame({'Actual':y_test,'predicted':ypred})

           Actual     predicted
764    9095.06825   8554.817116
887    5272.17580   6973.587467
890   29330.98315  36798.604161
1293   9301.89355   9417.882823
259   33750.29180  26871.680311
...           ...           ...
109   47055.53210  39220.995889
575   12222.89830  11695.634124
535    6067.12675   7253.598675
543   63770.42801  40950.539904
846    9872.70100  12625.966419

[268 rows x 2 columns]